PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_u55.h
/* U55_BASE_1_0.ID */
#define U55_BASE_1_0_ID_VERSION_STATUS_Pos      0UL
#define U55_BASE_1_0_ID_VERSION_STATUS_Msk      0xFUL
#define U55_BASE_1_0_ID_VERSION_MINOR_Pos       4UL
#define U55_BASE_1_0_ID_VERSION_MINOR_Msk       0xF0UL
#define U55_BASE_1_0_ID_VERSION_MAJOR_Pos       8UL
#define U55_BASE_1_0_ID_VERSION_MAJOR_Msk       0xF00UL
#define U55_BASE_1_0_ID_PRODUCT_MAJOR_Pos       12UL
#define U55_BASE_1_0_ID_PRODUCT_MAJOR_Msk       0xF000UL
#define U55_BASE_1_0_ID_ARCH_PATCH_REV_Pos      16UL
#define U55_BASE_1_0_ID_ARCH_PATCH_REV_Msk      0xF0000UL
#define U55_BASE_1_0_ID_ARCH_MINOR_REV_Pos      20UL
#define U55_BASE_1_0_ID_ARCH_MINOR_REV_Msk      0xFF00000UL
#define U55_BASE_1_0_ID_ARCH_MAJOR_REV_Pos      28UL
#define U55_BASE_1_0_ID_ARCH_MAJOR_REV_Msk      0xF0000000UL
/* U55_BASE_1_0.STATUS */
#define U55_BASE_1_0_STATUS_STATE_Pos           0UL
#define U55_BASE_1_0_STATUS_STATE_Msk           0x1UL
#define U55_BASE_1_0_STATUS_IRQ_RAISED_Pos      1UL
#define U55_BASE_1_0_STATUS_IRQ_RAISED_Msk      0x2UL
#define U55_BASE_1_0_STATUS_BUS_STATUS_Pos      2UL
#define U55_BASE_1_0_STATUS_BUS_STATUS_Msk      0x4UL
#define U55_BASE_1_0_STATUS_RESET_STATUS_Pos    3UL
#define U55_BASE_1_0_STATUS_RESET_STATUS_Msk    0x8UL
#define U55_BASE_1_0_STATUS_CMD_PARSE_ERROR_Pos 4UL
#define U55_BASE_1_0_STATUS_CMD_PARSE_ERROR_Msk 0x10UL
#define U55_BASE_1_0_STATUS_CMD_END_REACHED_Pos 5UL
#define U55_BASE_1_0_STATUS_CMD_END_REACHED_Msk 0x20UL
#define U55_BASE_1_0_STATUS_PMU_IRQ_RAISED_Pos  6UL
#define U55_BASE_1_0_STATUS_PMU_IRQ_RAISED_Msk  0x40UL
#define U55_BASE_1_0_STATUS_FAULTING_INTERFACE_Pos 11UL
#define U55_BASE_1_0_STATUS_FAULTING_INTERFACE_Msk 0x800UL
#define U55_BASE_1_0_STATUS_FAULTING_CHANNEL_Pos 12UL
#define U55_BASE_1_0_STATUS_FAULTING_CHANNEL_Msk 0xF000UL
#define U55_BASE_1_0_STATUS_IRQ_HISTORY_MASK_Pos 16UL
#define U55_BASE_1_0_STATUS_IRQ_HISTORY_MASK_Msk 0xFFFF0000UL
/* U55_BASE_1_0.CMD */
#define U55_BASE_1_0_CMD_TRANSITION_TO_RUNNING_STATE_Pos 0UL
#define U55_BASE_1_0_CMD_TRANSITION_TO_RUNNING_STATE_Msk 0x1UL
#define U55_BASE_1_0_CMD_CLEAR_IRQ_Pos          1UL
#define U55_BASE_1_0_CMD_CLEAR_IRQ_Msk          0x2UL
#define U55_BASE_1_0_CMD_CLOCK_Q_ENABLE_Pos     2UL
#define U55_BASE_1_0_CMD_CLOCK_Q_ENABLE_Msk     0x4UL
#define U55_BASE_1_0_CMD_POWER_Q_ENABLE_Pos     3UL
#define U55_BASE_1_0_CMD_POWER_Q_ENABLE_Msk     0x8UL
#define U55_BASE_1_0_CMD_CLEAR_IRQ_HISTORY_Pos  16UL
#define U55_BASE_1_0_CMD_CLEAR_IRQ_HISTORY_Msk  0xFFFF0000UL
/* U55_BASE_1_0.RESET */
#define U55_BASE_1_0_RESET_PENDING_CPL_Pos      0UL
#define U55_BASE_1_0_RESET_PENDING_CPL_Msk      0x1UL
#define U55_BASE_1_0_RESET_PENDING_CSL_Pos      1UL
#define U55_BASE_1_0_RESET_PENDING_CSL_Msk      0x2UL
/* U55_BASE_1_0.QBASE0 */
#define U55_BASE_1_0_QBASE0_QBASE0_Pos          0UL
#define U55_BASE_1_0_QBASE0_QBASE0_Msk          0xFFFFFFFFUL
/* U55_BASE_1_0.QBASE1 */
#define U55_BASE_1_0_QBASE1_QBASE1_Pos          0UL
#define U55_BASE_1_0_QBASE1_QBASE1_Msk          0xFFFFFFFFUL
/* U55_BASE_1_0.QREAD */
#define U55_BASE_1_0_QREAD_QREAD_Pos            0UL
#define U55_BASE_1_0_QREAD_QREAD_Msk            0xFFFFFFFFUL
/* U55_BASE_1_0.QCONFIG */
#define U55_BASE_1_0_QCONFIG_QCONFIG_Pos        0UL
#define U55_BASE_1_0_QCONFIG_QCONFIG_Msk        0xFFFFFFFFUL
/* U55_BASE_1_0.QSIZE */
#define U55_BASE_1_0_QSIZE_QSIZE_Pos            0UL
#define U55_BASE_1_0_QSIZE_QSIZE_Msk            0xFFFFFFFFUL
/* U55_BASE_1_0.PROT */
#define U55_BASE_1_0_PROT_ACTIVE_CPL_Pos        0UL
#define U55_BASE_1_0_PROT_ACTIVE_CPL_Msk        0x1UL
#define U55_BASE_1_0_PROT_ACTIVE_CSL_Pos        1UL
#define U55_BASE_1_0_PROT_ACTIVE_CSL_Msk        0x2UL
/* U55_BASE_1_0.CONFIG */
#define U55_BASE_1_0_CONFIG_MACS_PER_CC_Pos     0UL
#define U55_BASE_1_0_CONFIG_MACS_PER_CC_Msk     0xFUL
#define U55_BASE_1_0_CONFIG_CMD_STREAM_VERSION_Pos 4UL
#define U55_BASE_1_0_CONFIG_CMD_STREAM_VERSION_Msk 0xF0UL
#define U55_BASE_1_0_CONFIG_SHRAM_SIZE_Pos      8UL
#define U55_BASE_1_0_CONFIG_SHRAM_SIZE_Msk      0xFF00UL
#define U55_BASE_1_0_CONFIG_PRODUCT_Pos         28UL
#define U55_BASE_1_0_CONFIG_PRODUCT_Msk         0xF0000000UL
/* U55_BASE_1_0.LOCK */
#define U55_BASE_1_0_LOCK_LOCK_Pos              0UL
#define U55_BASE_1_0_LOCK_LOCK_Msk              0xFFFFFFFFUL
/* U55_BASE_1_0.REGIONCFG */
#define U55_BASE_1_0_REGIONCFG_REGION0_Pos      0UL
#define U55_BASE_1_0_REGIONCFG_REGION0_Msk      0x3UL
#define U55_BASE_1_0_REGIONCFG_REGION1_Pos      2UL
#define U55_BASE_1_0_REGIONCFG_REGION1_Msk      0xCUL
#define U55_BASE_1_0_REGIONCFG_REGION2_Pos      4UL
#define U55_BASE_1_0_REGIONCFG_REGION2_Msk      0x30UL
#define U55_BASE_1_0_REGIONCFG_REGION3_Pos      6UL
#define U55_BASE_1_0_REGIONCFG_REGION3_Msk      0xC0UL
#define U55_BASE_1_0_REGIONCFG_REGION4_Pos      8UL
#define U55_BASE_1_0_REGIONCFG_REGION4_Msk      0x300UL
#define U55_BASE_1_0_REGIONCFG_REGION5_Pos      10UL
#define U55_BASE_1_0_REGIONCFG_REGION5_Msk      0xC00UL
#define U55_BASE_1_0_REGIONCFG_REGION6_Pos      12UL
#define U55_BASE_1_0_REGIONCFG_REGION6_Msk      0x3000UL
#define U55_BASE_1_0_REGIONCFG_REGION7_Pos      14UL
#define U55_BASE_1_0_REGIONCFG_REGION7_Msk      0xC000UL
/* U55_BASE_1_0.AXI_LIMIT0 */
#define U55_BASE_1_0_AXI_LIMIT0_MAX_BEATS_Pos   0UL
#define U55_BASE_1_0_AXI_LIMIT0_MAX_BEATS_Msk   0x3UL
#define U55_BASE_1_0_AXI_LIMIT0_MEMTYPE_Pos     4UL
#define U55_BASE_1_0_AXI_LIMIT0_MEMTYPE_Msk     0xF0UL
#define U55_BASE_1_0_AXI_LIMIT0_MAX_OUTSTANDING_READ_M1_Pos 16UL
#define U55_BASE_1_0_AXI_LIMIT0_MAX_OUTSTANDING_READ_M1_Msk 0xFF0000UL
#define U55_BASE_1_0_AXI_LIMIT0_MAX_OUTSTANDING_WRITE_M1_Pos 24UL
#define U55_BASE_1_0_AXI_LIMIT0_MAX_OUTSTANDING_WRITE_M1_Msk 0xFF000000UL
/* U55_BASE_1_0.AXI_LIMIT1 */
#define U55_BASE_1_0_AXI_LIMIT1_MAX_BEATS_Pos   0UL
#define U55_BASE_1_0_AXI_LIMIT1_MAX_BEATS_Msk   0x3UL
#define U55_BASE_1_0_AXI_LIMIT1_MEMTYPE_Pos     4UL
#define U55_BASE_1_0_AXI_LIMIT1_MEMTYPE_Msk     0xF0UL
#define U55_BASE_1_0_AXI_LIMIT1_MAX_OUTSTANDING_READ_M1_Pos 16UL
#define U55_BASE_1_0_AXI_LIMIT1_MAX_OUTSTANDING_READ_M1_Msk 0xFF0000UL
#define U55_BASE_1_0_AXI_LIMIT1_MAX_OUTSTANDING_WRITE_M1_Pos 24UL
#define U55_BASE_1_0_AXI_LIMIT1_MAX_OUTSTANDING_WRITE_M1_Msk 0xFF000000UL
/* U55_BASE_1_0.AXI_LIMIT2 */
#define U55_BASE_1_0_AXI_LIMIT2_MAX_BEATS_Pos   0UL
#define U55_BASE_1_0_AXI_LIMIT2_MAX_BEATS_Msk   0x3UL
#define U55_BASE_1_0_AXI_LIMIT2_MEMTYPE_Pos     4UL
#define U55_BASE_1_0_AXI_LIMIT2_MEMTYPE_Msk     0xF0UL
#define U55_BASE_1_0_AXI_LIMIT2_MAX_OUTSTANDING_READ_M1_Pos 16UL
#define U55_BASE_1_0_AXI_LIMIT2_MAX_OUTSTANDING_READ_M1_Msk 0xFF0000UL
#define U55_BASE_1_0_AXI_LIMIT2_MAX_OUTSTANDING_WRITE_M1_Pos 24UL
#define U55_BASE_1_0_AXI_LIMIT2_MAX_OUTSTANDING_WRITE_M1_Msk 0xFF000000UL
/* U55_BASE_1_0.AXI_LIMIT3 */
#define U55_BASE_1_0_AXI_LIMIT3_MAX_BEATS_Pos   0UL
#define U55_BASE_1_0_AXI_LIMIT3_MAX_BEATS_Msk   0x3UL
#define U55_BASE_1_0_AXI_LIMIT3_MEMTYPE_Pos     4UL
#define U55_BASE_1_0_AXI_LIMIT3_MEMTYPE_Msk     0xF0UL
#define U55_BASE_1_0_AXI_LIMIT3_MAX_OUTSTANDING_READ_M1_Pos 16UL
#define U55_BASE_1_0_AXI_LIMIT3_MAX_OUTSTANDING_READ_M1_Msk 0xFF0000UL
#define U55_BASE_1_0_AXI_LIMIT3_MAX_OUTSTANDING_WRITE_M1_Pos 24UL
#define U55_BASE_1_0_AXI_LIMIT3_MAX_OUTSTANDING_WRITE_M1_Msk 0xFF000000UL


