PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_u55.h
/* U55_BASE_POINTERS_1_0.BASEP0 */
#define U55_BASE_POINTERS_1_0_BASEP0_ADDR_WORD_Pos 0UL
#define U55_BASE_POINTERS_1_0_BASEP0_ADDR_WORD_Msk 0xFFFFFFFFUL
/* U55_BASE_POINTERS_1_0.BASEP1 */
#define U55_BASE_POINTERS_1_0_BASEP1_ADDR_WORD_Pos 0UL
#define U55_BASE_POINTERS_1_0_BASEP1_ADDR_WORD_Msk 0xFFFFFFFFUL
/* U55_BASE_POINTERS_1_0.BASEP2 */
#define U55_BASE_POINTERS_1_0_BASEP2_ADDR_WORD_Pos 0UL
#define U55_BASE_POINTERS_1_0_BASEP2_ADDR_WORD_Msk 0xFFFFFFFFUL
/* U55_BASE_POINTERS_1_0.BASEP3 */
#define U55_BASE_POINTERS_1_0_BASEP3_ADDR_WORD_Pos 0UL
#define U55_BASE_POINTERS_1_0_BASEP3_ADDR_WORD_Msk 0xFFFFFFFFUL
/* U55_BASE_POINTERS_1_0.BASEP4 */
#define U55_BASE_POINTERS_1_0_BASEP4_ADDR_WORD_Pos 0UL
#define U55_BASE_POINTERS_1_0_BASEP4_ADDR_WORD_Msk 0xFFFFFFFFUL
/* U55_BASE_POINTERS_1_0.BASEP5 */
#define U55_BASE_POINTERS_1_0_BASEP5_ADDR_WORD_Pos 0UL
#define U55_BASE_POINTERS_1_0_BASEP5_ADDR_WORD_Msk 0xFFFFFFFFUL
/* U55_BASE_POINTERS_1_0.BASEP6 */
#define U55_BASE_POINTERS_1_0_BASEP6_ADDR_WORD_Pos 0UL
#define U55_BASE_POINTERS_1_0_BASEP6_ADDR_WORD_Msk 0xFFFFFFFFUL
/* U55_BASE_POINTERS_1_0.BASEP7 */
#define U55_BASE_POINTERS_1_0_BASEP7_ADDR_WORD_Pos 0UL
#define U55_BASE_POINTERS_1_0_BASEP7_ADDR_WORD_Msk 0xFFFFFFFFUL
/* U55_BASE_POINTERS_1_0.BASEP8 */
#define U55_BASE_POINTERS_1_0_BASEP8_ADDR_WORD_Pos 0UL
#define U55_BASE_POINTERS_1_0_BASEP8_ADDR_WORD_Msk 0xFFFFFFFFUL
/* U55_BASE_POINTERS_1_0.BASEP9 */
#define U55_BASE_POINTERS_1_0_BASEP9_ADDR_WORD_Pos 0UL
#define U55_BASE_POINTERS_1_0_BASEP9_ADDR_WORD_Msk 0xFFFFFFFFUL
/* U55_BASE_POINTERS_1_0.BASEP10 */
#define U55_BASE_POINTERS_1_0_BASEP10_ADDR_WORD_Pos 0UL
#define U55_BASE_POINTERS_1_0_BASEP10_ADDR_WORD_Msk 0xFFFFFFFFUL
/* U55_BASE_POINTERS_1_0.BASEP11 */
#define U55_BASE_POINTERS_1_0_BASEP11_ADDR_WORD_Pos 0UL
#define U55_BASE_POINTERS_1_0_BASEP11_ADDR_WORD_Msk 0xFFFFFFFFUL
/* U55_BASE_POINTERS_1_0.BASEP12 */
#define U55_BASE_POINTERS_1_0_BASEP12_ADDR_WORD_Pos 0UL
#define U55_BASE_POINTERS_1_0_BASEP12_ADDR_WORD_Msk 0xFFFFFFFFUL
/* U55_BASE_POINTERS_1_0.BASEP13 */
#define U55_BASE_POINTERS_1_0_BASEP13_ADDR_WORD_Pos 0UL
#define U55_BASE_POINTERS_1_0_BASEP13_ADDR_WORD_Msk 0xFFFFFFFFUL
/* U55_BASE_POINTERS_1_0.BASEP14 */
#define U55_BASE_POINTERS_1_0_BASEP14_ADDR_WORD_Pos 0UL
#define U55_BASE_POINTERS_1_0_BASEP14_ADDR_WORD_Msk 0xFFFFFFFFUL
/* U55_BASE_POINTERS_1_0.BASEP15 */
#define U55_BASE_POINTERS_1_0_BASEP15_ADDR_WORD_Pos 0UL
#define U55_BASE_POINTERS_1_0_BASEP15_ADDR_WORD_Msk 0xFFFFFFFFUL


/* U55_PAGE_PMU_1_0.PMCR */
#define U55_PAGE_PMU_1_0_PMCR_CNT_EN_Pos        0UL
#define U55_PAGE_PMU_1_0_PMCR_CNT_EN_Msk        0x1UL
#define U55_PAGE_PMU_1_0_PMCR_EVENT_CNT_RST_Pos 1UL
#define U55_PAGE_PMU_1_0_PMCR_EVENT_CNT_RST_Msk 0x2UL
#define U55_PAGE_PMU_1_0_PMCR_CYCLE_CNT_RST_Pos 2UL
#define U55_PAGE_PMU_1_0_PMCR_CYCLE_CNT_RST_Msk 0x4UL
#define U55_PAGE_PMU_1_0_PMCR_MASK_EN_Pos       3UL
#define U55_PAGE_PMU_1_0_PMCR_MASK_EN_Msk       0x8UL
#define U55_PAGE_PMU_1_0_PMCR_NUM_EVENT_CNT_Pos 11UL
#define U55_PAGE_PMU_1_0_PMCR_NUM_EVENT_CNT_Msk 0xF800UL
/* U55_PAGE_PMU_1_0.PMCNTENSET */
#define U55_PAGE_PMU_1_0_PMCNTENSET_EVENT_CNT_0_Pos 0UL
#define U55_PAGE_PMU_1_0_PMCNTENSET_EVENT_CNT_0_Msk 0x1UL
#define U55_PAGE_PMU_1_0_PMCNTENSET_EVENT_CNT_1_Pos 1UL
#define U55_PAGE_PMU_1_0_PMCNTENSET_EVENT_CNT_1_Msk 0x2UL
#define U55_PAGE_PMU_1_0_PMCNTENSET_EVENT_CNT_2_Pos 2UL
#define U55_PAGE_PMU_1_0_PMCNTENSET_EVENT_CNT_2_Msk 0x4UL
#define U55_PAGE_PMU_1_0_PMCNTENSET_EVENT_CNT_3_Pos 3UL
#define U55_PAGE_PMU_1_0_PMCNTENSET_EVENT_CNT_3_Msk 0x8UL
#define U55_PAGE_PMU_1_0_PMCNTENSET_CYCLE_CNT_Pos 31UL
#define U55_PAGE_PMU_1_0_PMCNTENSET_CYCLE_CNT_Msk 0x80000000UL
/* U55_PAGE_PMU_1_0.PMCNTENCLR */
#define U55_PAGE_PMU_1_0_PMCNTENCLR_EVENT_CNT_0_Pos 0UL
#define U55_PAGE_PMU_1_0_PMCNTENCLR_EVENT_CNT_0_Msk 0x1UL
#define U55_PAGE_PMU_1_0_PMCNTENCLR_EVENT_CNT_1_Pos 1UL
#define U55_PAGE_PMU_1_0_PMCNTENCLR_EVENT_CNT_1_Msk 0x2UL
#define U55_PAGE_PMU_1_0_PMCNTENCLR_EVENT_CNT_2_Pos 2UL
#define U55_PAGE_PMU_1_0_PMCNTENCLR_EVENT_CNT_2_Msk 0x4UL
#define U55_PAGE_PMU_1_0_PMCNTENCLR_EVENT_CNT_3_Pos 3UL
#define U55_PAGE_PMU_1_0_PMCNTENCLR_EVENT_CNT_3_Msk 0x8UL
#define U55_PAGE_PMU_1_0_PMCNTENCLR_CYCLE_CNT_Pos 31UL
#define U55_PAGE_PMU_1_0_PMCNTENCLR_CYCLE_CNT_Msk 0x80000000UL
/* U55_PAGE_PMU_1_0.PMOVSSET */
#define U55_PAGE_PMU_1_0_PMOVSSET_EVENT_CNT_0_OVF_Pos 0UL
#define U55_PAGE_PMU_1_0_PMOVSSET_EVENT_CNT_0_OVF_Msk 0x1UL
#define U55_PAGE_PMU_1_0_PMOVSSET_EVENT_CNT_1_OVF_Pos 1UL
#define U55_PAGE_PMU_1_0_PMOVSSET_EVENT_CNT_1_OVF_Msk 0x2UL
#define U55_PAGE_PMU_1_0_PMOVSSET_EVENT_CNT_2_OVF_Pos 2UL
#define U55_PAGE_PMU_1_0_PMOVSSET_EVENT_CNT_2_OVF_Msk 0x4UL
#define U55_PAGE_PMU_1_0_PMOVSSET_EVENT_CNT_3_OVF_Pos 3UL
#define U55_PAGE_PMU_1_0_PMOVSSET_EVENT_CNT_3_OVF_Msk 0x8UL
#define U55_PAGE_PMU_1_0_PMOVSSET_CYCLE_CNT_OVF_Pos 31UL
#define U55_PAGE_PMU_1_0_PMOVSSET_CYCLE_CNT_OVF_Msk 0x80000000UL
/* U55_PAGE_PMU_1_0.PMOVSCLR */
#define U55_PAGE_PMU_1_0_PMOVSCLR_EVENT_CNT_0_OVF_Pos 0UL
#define U55_PAGE_PMU_1_0_PMOVSCLR_EVENT_CNT_0_OVF_Msk 0x1UL
#define U55_PAGE_PMU_1_0_PMOVSCLR_EVENT_CNT_1_OVF_Pos 1UL
#define U55_PAGE_PMU_1_0_PMOVSCLR_EVENT_CNT_1_OVF_Msk 0x2UL
#define U55_PAGE_PMU_1_0_PMOVSCLR_EVENT_CNT_2_OVF_Pos 2UL
#define U55_PAGE_PMU_1_0_PMOVSCLR_EVENT_CNT_2_OVF_Msk 0x4UL
#define U55_PAGE_PMU_1_0_PMOVSCLR_EVENT_CNT_3_OVF_Pos 3UL
#define U55_PAGE_PMU_1_0_PMOVSCLR_EVENT_CNT_3_OVF_Msk 0x8UL
#define U55_PAGE_PMU_1_0_PMOVSCLR_CYCLE_CNT_OVF_Pos 31UL
#define U55_PAGE_PMU_1_0_PMOVSCLR_CYCLE_CNT_OVF_Msk 0x80000000UL
/* U55_PAGE_PMU_1_0.PMINTSET */
#define U55_PAGE_PMU_1_0_PMINTSET_EVENT_CNT_0_INT_Pos 0UL
#define U55_PAGE_PMU_1_0_PMINTSET_EVENT_CNT_0_INT_Msk 0x1UL
#define U55_PAGE_PMU_1_0_PMINTSET_EVENT_CNT_1_INT_Pos 1UL
#define U55_PAGE_PMU_1_0_PMINTSET_EVENT_CNT_1_INT_Msk 0x2UL
#define U55_PAGE_PMU_1_0_PMINTSET_EVENT_CNT_2_INT_Pos 2UL
#define U55_PAGE_PMU_1_0_PMINTSET_EVENT_CNT_2_INT_Msk 0x4UL
#define U55_PAGE_PMU_1_0_PMINTSET_EVENT_CNT_3_INT_Pos 3UL
#define U55_PAGE_PMU_1_0_PMINTSET_EVENT_CNT_3_INT_Msk 0x8UL
#define U55_PAGE_PMU_1_0_PMINTSET_CYCLE_CNT_INT_Pos 31UL
#define U55_PAGE_PMU_1_0_PMINTSET_CYCLE_CNT_INT_Msk 0x80000000UL
/* U55_PAGE_PMU_1_0.PMINTCLR */
#define U55_PAGE_PMU_1_0_PMINTCLR_EVENT_CNT_0_INT_Pos 0UL
#define U55_PAGE_PMU_1_0_PMINTCLR_EVENT_CNT_0_INT_Msk 0x1UL
#define U55_PAGE_PMU_1_0_PMINTCLR_EVENT_CNT_1_INT_Pos 1UL
#define U55_PAGE_PMU_1_0_PMINTCLR_EVENT_CNT_1_INT_Msk 0x2UL
#define U55_PAGE_PMU_1_0_PMINTCLR_EVENT_CNT_2_INT_Pos 2UL
#define U55_PAGE_PMU_1_0_PMINTCLR_EVENT_CNT_2_INT_Msk 0x4UL
#define U55_PAGE_PMU_1_0_PMINTCLR_EVENT_CNT_3_INT_Pos 3UL
#define U55_PAGE_PMU_1_0_PMINTCLR_EVENT_CNT_3_INT_Msk 0x8UL
#define U55_PAGE_PMU_1_0_PMINTCLR_CYCLE_CNT_INT_Pos 31UL
#define U55_PAGE_PMU_1_0_PMINTCLR_CYCLE_CNT_INT_Msk 0x80000000UL
/* U55_PAGE_PMU_1_0.PMCCNTR_LO */
#define U55_PAGE_PMU_1_0_PMCCNTR_LO_CYCLE_CNT_LO_Pos 0UL
#define U55_PAGE_PMU_1_0_PMCCNTR_LO_CYCLE_CNT_LO_Msk 0xFFFFFFFFUL
/* U55_PAGE_PMU_1_0.PMCCNTR_HI */
#define U55_PAGE_PMU_1_0_PMCCNTR_HI_CYCLE_CNT_HI_Pos 0UL
#define U55_PAGE_PMU_1_0_PMCCNTR_HI_CYCLE_CNT_HI_Msk 0xFFFFUL
/* U55_PAGE_PMU_1_0.PMCCNTR_CFG */
#define U55_PAGE_PMU_1_0_PMCCNTR_CFG_CYCLE_CNT_CFG_START_Pos 0UL
#define U55_PAGE_PMU_1_0_PMCCNTR_CFG_CYCLE_CNT_CFG_START_Msk 0x3FFUL
#define U55_PAGE_PMU_1_0_PMCCNTR_CFG_CYCLE_CNT_CFG_STOP_Pos 16UL
#define U55_PAGE_PMU_1_0_PMCCNTR_CFG_CYCLE_CNT_CFG_STOP_Msk 0x3FF0000UL
/* U55_PAGE_PMU_1_0.PMCAXI_CHAN */
#define U55_PAGE_PMU_1_0_PMCAXI_CHAN_CH_SEL_Pos 0UL
#define U55_PAGE_PMU_1_0_PMCAXI_CHAN_CH_SEL_Msk 0xFUL
#define U55_PAGE_PMU_1_0_PMCAXI_CHAN_AXI_CNT_SEL_Pos 8UL
#define U55_PAGE_PMU_1_0_PMCAXI_CHAN_AXI_CNT_SEL_Msk 0x300UL
#define U55_PAGE_PMU_1_0_PMCAXI_CHAN_BW_CH_SEL_EN_Pos 10UL
#define U55_PAGE_PMU_1_0_PMCAXI_CHAN_BW_CH_SEL_EN_Msk 0x400UL
/* U55_PAGE_PMU_1_0.PMU_EVCNTR */
#define U55_PAGE_PMU_1_0_PMU_EVCNTR_PMU_EVCNTR_Pos 0UL
#define U55_PAGE_PMU_1_0_PMU_EVCNTR_PMU_EVCNTR_Msk 0xFFFFFFFFUL
/* U55_PAGE_PMU_1_0.PMU_ENTYPER */
#define U55_PAGE_PMU_1_0_PMU_ENTYPER_EV_TYPE_Pos 0UL
#define U55_PAGE_PMU_1_0_PMU_ENTYPER_EV_TYPE_Msk 0x3FFUL


/* U55_PAGE_ID_1_0.PID4 */
#define U55_PAGE_ID_1_0_PID4_PID4_Pos           0UL
#define U55_PAGE_ID_1_0_PID4_PID4_Msk           0xFFFFFFFFUL
/* U55_PAGE_ID_1_0.PID5 */
#define U55_PAGE_ID_1_0_PID5_PID5_Pos           0UL
#define U55_PAGE_ID_1_0_PID5_PID5_Msk           0xFFFFFFFFUL
/* U55_PAGE_ID_1_0.PID6 */
#define U55_PAGE_ID_1_0_PID6_PID6_Pos           0UL
#define U55_PAGE_ID_1_0_PID6_PID6_Msk           0xFFFFFFFFUL
/* U55_PAGE_ID_1_0.PID7 */
#define U55_PAGE_ID_1_0_PID7_PID7_Pos           0UL
#define U55_PAGE_ID_1_0_PID7_PID7_Msk           0xFFFFFFFFUL
/* U55_PAGE_ID_1_0.PID0 */
#define U55_PAGE_ID_1_0_PID0_PID0_Pos           0UL
#define U55_PAGE_ID_1_0_PID0_PID0_Msk           0xFFFFFFFFUL
/* U55_PAGE_ID_1_0.PID1 */
#define U55_PAGE_ID_1_0_PID1_PID1_Pos           0UL
#define U55_PAGE_ID_1_0_PID1_PID1_Msk           0xFFFFFFFFUL
/* U55_PAGE_ID_1_0.PID2 */
#define U55_PAGE_ID_1_0_PID2_PID2_Pos           0UL
#define U55_PAGE_ID_1_0_PID2_PID2_Msk           0xFFFFFFFFUL
/* U55_PAGE_ID_1_0.PID3 */
#define U55_PAGE_ID_1_0_PID3_PID3_Pos           0UL
#define U55_PAGE_ID_1_0_PID3_PID3_Msk           0xFFFFFFFFUL
/* U55_PAGE_ID_1_0.CID0 */
#define U55_PAGE_ID_1_0_CID0_CID0_Pos           0UL
#define U55_PAGE_ID_1_0_CID0_CID0_Msk           0xFFFFFFFFUL
/* U55_PAGE_ID_1_0.CID1 */
#define U55_PAGE_ID_1_0_CID1_CID1_Pos           0UL
#define U55_PAGE_ID_1_0_CID1_CID1_Msk           0xFFFFFFFFUL
/* U55_PAGE_ID_1_0.CID2 */
#define U55_PAGE_ID_1_0_CID2_CID2_Pos           0UL
#define U55_PAGE_ID_1_0_CID2_CID2_Msk           0xFFFFFFFFUL
/* U55_PAGE_ID_1_0.CID3 */
#define U55_PAGE_ID_1_0_CID3_CID3_Pos           0UL
#define U55_PAGE_ID_1_0_CID3_CID3_Msk           0xFFFFFFFFUL


/* U55_MXU55_CTL_1_0.ROT_INIT */
#define U55_MXU55_CTL_1_0_ROT_INIT_PRIVILEGE_LEVEL_Pos 1UL
#define U55_MXU55_CTL_1_0_ROT_INIT_PRIVILEGE_LEVEL_Msk 0x2UL
#define U55_MXU55_CTL_1_0_ROT_INIT_SECURITY_LEVEL_Pos 2UL
#define U55_MXU55_CTL_1_0_ROT_INIT_SECURITY_LEVEL_Msk 0x4UL
/* U55_MXU55_CTL_1_0.ACG_CTL */
#define U55_MXU55_CTL_1_0_ACG_CTL_CFG_GATE_RESP_Pos 0UL
#define U55_MXU55_CTL_1_0_ACG_CTL_CFG_GATE_RESP_Msk 0x1UL


