PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_u55.h
/* U55_MXU55_PPU.PWPR */
#define U55_MXU55_PPU_PWPR_PWR_POLICY_Pos       0UL
#define U55_MXU55_PPU_PWPR_PWR_POLICY_Msk       0xFUL
#define U55_MXU55_PPU_PWPR_PWR_DYN_EN_Pos       8UL
#define U55_MXU55_PPU_PWPR_PWR_DYN_EN_Msk       0x100UL
#define U55_MXU55_PPU_PWPR_LOCK_EN_Pos          12UL
#define U55_MXU55_PPU_PWPR_LOCK_EN_Msk          0x1000UL
#define U55_MXU55_PPU_PWPR_OP_POLICY_Pos        16UL
#define U55_MXU55_PPU_PWPR_OP_POLICY_Msk        0xF0000UL
#define U55_MXU55_PPU_PWPR_OP_DYN_EN_Pos        24UL
#define U55_MXU55_PPU_PWPR_OP_DYN_EN_Msk        0x1000000UL
/* U55_MXU55_PPU.PMER */
#define U55_MXU55_PPU_PMER_EMU_EN_Pos           0UL
#define U55_MXU55_PPU_PMER_EMU_EN_Msk           0x1UL
/* U55_MXU55_PPU.PWSR */
#define U55_MXU55_PPU_PWSR_PWR_STATUS_Pos       0UL
#define U55_MXU55_PPU_PWSR_PWR_STATUS_Msk       0xFUL
#define U55_MXU55_PPU_PWSR_PWR_DYN_STATUS_Pos   8UL
#define U55_MXU55_PPU_PWSR_PWR_DYN_STATUS_Msk   0x100UL
#define U55_MXU55_PPU_PWSR_LOCK_STATUS_Pos      12UL
#define U55_MXU55_PPU_PWSR_LOCK_STATUS_Msk      0x1000UL
#define U55_MXU55_PPU_PWSR_OP_STATUS_Pos        16UL
#define U55_MXU55_PPU_PWSR_OP_STATUS_Msk        0xF0000UL
#define U55_MXU55_PPU_PWSR_OP_DYN_STATUS_Pos    24UL
#define U55_MXU55_PPU_PWSR_OP_DYN_STATUS_Msk    0x1000000UL
/* U55_MXU55_PPU.DISR */
#define U55_MXU55_PPU_DISR_PWR_DEVACTIVE_STATUS_Pos 0UL
#define U55_MXU55_PPU_DISR_PWR_DEVACTIVE_STATUS_Msk 0x7FFUL
#define U55_MXU55_PPU_DISR_OP_DEVACTIVE_STATUS_Pos 24UL
#define U55_MXU55_PPU_DISR_OP_DEVACTIVE_STATUS_Msk 0xFF000000UL
/* U55_MXU55_PPU.MISR */
#define U55_MXU55_PPU_MISR_PCSMPACCEPT_STATUS_Pos 0UL
#define U55_MXU55_PPU_MISR_PCSMPACCEPT_STATUS_Msk 0x1UL
#define U55_MXU55_PPU_MISR_DEVACCEPT_STATUS_Pos 8UL
#define U55_MXU55_PPU_MISR_DEVACCEPT_STATUS_Msk 0xFF00UL
#define U55_MXU55_PPU_MISR_DEVDENY_STATUS_Pos   16UL
#define U55_MXU55_PPU_MISR_DEVDENY_STATUS_Msk   0xFF0000UL
/* U55_MXU55_PPU.STSR */
#define U55_MXU55_PPU_STSR_STORED_DEVDENY_Pos   0UL
#define U55_MXU55_PPU_STSR_STORED_DEVDENY_Msk   0xFFUL
/* U55_MXU55_PPU.UNLK */
#define U55_MXU55_PPU_UNLK_UNLOCK_Pos           0UL
#define U55_MXU55_PPU_UNLK_UNLOCK_Msk           0x1UL
/* U55_MXU55_PPU.PWCR */
#define U55_MXU55_PPU_PWCR_DEVREQEN_Pos         0UL
#define U55_MXU55_PPU_PWCR_DEVREQEN_Msk         0xFFUL
#define U55_MXU55_PPU_PWCR_PWR_DEVACTIVEEN_Pos  8UL
#define U55_MXU55_PPU_PWCR_PWR_DEVACTIVEEN_Msk  0x7FF00UL
#define U55_MXU55_PPU_PWCR_OP_DEVACTIVEEN_Pos   24UL
#define U55_MXU55_PPU_PWCR_OP_DEVACTIVEEN_Msk   0xFF000000UL
/* U55_MXU55_PPU.PTCR */
#define U55_MXU55_PPU_PTCR_WARM_RST_DEVREQEN_Pos 0UL
#define U55_MXU55_PPU_PTCR_WARM_RST_DEVREQEN_Msk 0x1UL
#define U55_MXU55_PPU_PTCR_DBG_RECOV_PORST_EN_Pos 1UL
#define U55_MXU55_PPU_PTCR_DBG_RECOV_PORST_EN_Msk 0x2UL
/* U55_MXU55_PPU.IMR */
#define U55_MXU55_PPU_IMR_STA_POLICY_TRN_IRQ_MASK_Pos 0UL
#define U55_MXU55_PPU_IMR_STA_POLICY_TRN_IRQ_MASK_Msk 0x1UL
#define U55_MXU55_PPU_IMR_STA_ACCEPT_IRQ_MASK_Pos 1UL
#define U55_MXU55_PPU_IMR_STA_ACCEPT_IRQ_MASK_Msk 0x2UL
#define U55_MXU55_PPU_IMR_STA_DENY_IRQ_MASK_Pos 2UL
#define U55_MXU55_PPU_IMR_STA_DENY_IRQ_MASK_Msk 0x4UL
#define U55_MXU55_PPU_IMR_EMU_ACCEPT_IRQ_MASK_Pos 3UL
#define U55_MXU55_PPU_IMR_EMU_ACCEPT_IRQ_MASK_Msk 0x8UL
#define U55_MXU55_PPU_IMR_EMU_DENY_IRQ_MASK_Pos 4UL
#define U55_MXU55_PPU_IMR_EMU_DENY_IRQ_MASK_Msk 0x10UL
#define U55_MXU55_PPU_IMR_LOCKED_IRQ_MASK_Pos   5UL
#define U55_MXU55_PPU_IMR_LOCKED_IRQ_MASK_Msk   0x20UL
/* U55_MXU55_PPU.AIMR */
#define U55_MXU55_PPU_AIMR_UNSPT_POLICY_IRQ_MASK_Pos 0UL
#define U55_MXU55_PPU_AIMR_UNSPT_POLICY_IRQ_MASK_Msk 0x1UL
#define U55_MXU55_PPU_AIMR_DYN_ACCEPT_IRQ_MASK_Pos 1UL
#define U55_MXU55_PPU_AIMR_DYN_ACCEPT_IRQ_MASK_Msk 0x2UL
#define U55_MXU55_PPU_AIMR_DYN_DENY_IRQ_MASK_Pos 2UL
#define U55_MXU55_PPU_AIMR_DYN_DENY_IRQ_MASK_Msk 0x4UL
#define U55_MXU55_PPU_AIMR_STA_POLICY_PWR_IRQ_MASK_Pos 3UL
#define U55_MXU55_PPU_AIMR_STA_POLICY_PWR_IRQ_MASK_Msk 0x8UL
#define U55_MXU55_PPU_AIMR_STA_POLICY_OP_IRQ_MASK_Pos 4UL
#define U55_MXU55_PPU_AIMR_STA_POLICY_OP_IRQ_MASK_Msk 0x10UL
/* U55_MXU55_PPU.ISR */
#define U55_MXU55_PPU_ISR_STA_POLICY_TRN_IRQ_Pos 0UL
#define U55_MXU55_PPU_ISR_STA_POLICY_TRN_IRQ_Msk 0x1UL
#define U55_MXU55_PPU_ISR_STA_ACCEPT_IRQ_Pos    1UL
#define U55_MXU55_PPU_ISR_STA_ACCEPT_IRQ_Msk    0x2UL
#define U55_MXU55_PPU_ISR_STA_DENY_IRQ_Pos      2UL
#define U55_MXU55_PPU_ISR_STA_DENY_IRQ_Msk      0x4UL
#define U55_MXU55_PPU_ISR_EMU_ACCEPT_IRQ_Pos    3UL
#define U55_MXU55_PPU_ISR_EMU_ACCEPT_IRQ_Msk    0x8UL
#define U55_MXU55_PPU_ISR_EMU_DENY_IRQ_Pos      4UL
#define U55_MXU55_PPU_ISR_EMU_DENY_IRQ_Msk      0x10UL
#define U55_MXU55_PPU_ISR_LOCKED_IRQ_Pos        5UL
#define U55_MXU55_PPU_ISR_LOCKED_IRQ_Msk        0x20UL
#define U55_MXU55_PPU_ISR_OTHER_IRQ_Pos         7UL
#define U55_MXU55_PPU_ISR_OTHER_IRQ_Msk         0x80UL
#define U55_MXU55_PPU_ISR_PWR_ACTIVE_EDGE_IRQ_Pos 8UL
#define U55_MXU55_PPU_ISR_PWR_ACTIVE_EDGE_IRQ_Msk 0x7FF00UL
#define U55_MXU55_PPU_ISR_OP_ACTIVE_EDGE_IRQ_Pos 24UL
#define U55_MXU55_PPU_ISR_OP_ACTIVE_EDGE_IRQ_Msk 0xFF000000UL
/* U55_MXU55_PPU.AISR */
#define U55_MXU55_PPU_AISR_UNSPT_POLICY_IRQ_Pos 0UL
#define U55_MXU55_PPU_AISR_UNSPT_POLICY_IRQ_Msk 0x1UL
#define U55_MXU55_PPU_AISR_DYN_ACCEPT_IRQ_Pos   1UL
#define U55_MXU55_PPU_AISR_DYN_ACCEPT_IRQ_Msk   0x2UL
#define U55_MXU55_PPU_AISR_DYN_DENY_IRQ_Pos     2UL
#define U55_MXU55_PPU_AISR_DYN_DENY_IRQ_Msk     0x4UL
#define U55_MXU55_PPU_AISR_STA_POLICY_PWR_IRQ_Pos 3UL
#define U55_MXU55_PPU_AISR_STA_POLICY_PWR_IRQ_Msk 0x8UL
#define U55_MXU55_PPU_AISR_STA_POLICY_OP_IRQ_Pos 4UL
#define U55_MXU55_PPU_AISR_STA_POLICY_OP_IRQ_Msk 0x10UL
/* U55_MXU55_PPU.IESR */
#define U55_MXU55_PPU_IESR_DEVACTIVE00_EDGE_Pos 0UL
#define U55_MXU55_PPU_IESR_DEVACTIVE00_EDGE_Msk 0x3UL
#define U55_MXU55_PPU_IESR_DEVACTIVE01_EDGE_Pos 2UL
#define U55_MXU55_PPU_IESR_DEVACTIVE01_EDGE_Msk 0xCUL
#define U55_MXU55_PPU_IESR_DEVACTIVE02_EDGE_Pos 4UL
#define U55_MXU55_PPU_IESR_DEVACTIVE02_EDGE_Msk 0x30UL
#define U55_MXU55_PPU_IESR_DEVACTIVE03_EDGE_Pos 6UL
#define U55_MXU55_PPU_IESR_DEVACTIVE03_EDGE_Msk 0xC0UL
#define U55_MXU55_PPU_IESR_DEVACTIVE04_EDGE_Pos 8UL
#define U55_MXU55_PPU_IESR_DEVACTIVE04_EDGE_Msk 0x300UL
#define U55_MXU55_PPU_IESR_DEVACTIVE05_EDGE_Pos 10UL
#define U55_MXU55_PPU_IESR_DEVACTIVE05_EDGE_Msk 0xC00UL
#define U55_MXU55_PPU_IESR_DEVACTIVE06_EDGE_Pos 12UL
#define U55_MXU55_PPU_IESR_DEVACTIVE06_EDGE_Msk 0x3000UL
#define U55_MXU55_PPU_IESR_DEVACTIVE07_EDGE_Pos 14UL
#define U55_MXU55_PPU_IESR_DEVACTIVE07_EDGE_Msk 0xC000UL
#define U55_MXU55_PPU_IESR_DEVACTIVE08_EDGE_Pos 16UL
#define U55_MXU55_PPU_IESR_DEVACTIVE08_EDGE_Msk 0x30000UL
#define U55_MXU55_PPU_IESR_DEVACTIVE09_EDGE_Pos 18UL
#define U55_MXU55_PPU_IESR_DEVACTIVE09_EDGE_Msk 0xC0000UL
#define U55_MXU55_PPU_IESR_DEVACTIVE10_EDGE_Pos 20UL
#define U55_MXU55_PPU_IESR_DEVACTIVE10_EDGE_Msk 0x300000UL
/* U55_MXU55_PPU.OPSR */
#define U55_MXU55_PPU_OPSR_DEVACTIVE16_EDGE_Pos 0UL
#define U55_MXU55_PPU_OPSR_DEVACTIVE16_EDGE_Msk 0x3UL
#define U55_MXU55_PPU_OPSR_DEVACTIVE17_EDGE_Pos 2UL
#define U55_MXU55_PPU_OPSR_DEVACTIVE17_EDGE_Msk 0xCUL
#define U55_MXU55_PPU_OPSR_DEVACTIVE18_EDGE_Pos 4UL
#define U55_MXU55_PPU_OPSR_DEVACTIVE18_EDGE_Msk 0x30UL
#define U55_MXU55_PPU_OPSR_DEVACTIVE19_EDGE_Pos 6UL
#define U55_MXU55_PPU_OPSR_DEVACTIVE19_EDGE_Msk 0xC0UL
#define U55_MXU55_PPU_OPSR_DEVACTIVE20_EDGE_Pos 8UL
#define U55_MXU55_PPU_OPSR_DEVACTIVE20_EDGE_Msk 0x300UL
#define U55_MXU55_PPU_OPSR_DEVACTIVE21_EDGE_Pos 10UL
#define U55_MXU55_PPU_OPSR_DEVACTIVE21_EDGE_Msk 0xC00UL
#define U55_MXU55_PPU_OPSR_DEVACTIVE22_EDGE_Pos 12UL
#define U55_MXU55_PPU_OPSR_DEVACTIVE22_EDGE_Msk 0x3000UL
#define U55_MXU55_PPU_OPSR_DEVACTIVE23_EDGE_Pos 14UL
#define U55_MXU55_PPU_OPSR_DEVACTIVE23_EDGE_Msk 0xC000UL
/* U55_MXU55_PPU.FUNRR */
#define U55_MXU55_PPU_FUNRR_FUNC_RET_RAM_CFG_Pos 0UL
#define U55_MXU55_PPU_FUNRR_FUNC_RET_RAM_CFG_Msk 0xFFUL
/* U55_MXU55_PPU.FULRR */
#define U55_MXU55_PPU_FULRR_FULL_RET_RAM_CFG_Pos 0UL
#define U55_MXU55_PPU_FULRR_FULL_RET_RAM_CFG_Msk 0xFFUL
/* U55_MXU55_PPU.MEMRR */
#define U55_MXU55_PPU_MEMRR_MEM_RET_RAM_CFG_Pos 0UL
#define U55_MXU55_PPU_MEMRR_MEM_RET_RAM_CFG_Msk 0xFFUL
/* U55_MXU55_PPU.EDTR0 */
#define U55_MXU55_PPU_EDTR0_OFF_DEL_Pos         0UL
#define U55_MXU55_PPU_EDTR0_OFF_DEL_Msk         0xFFUL
#define U55_MXU55_PPU_EDTR0_MEM_RET_DEL_Pos     8UL
#define U55_MXU55_PPU_EDTR0_MEM_RET_DEL_Msk     0xFF00UL
#define U55_MXU55_PPU_EDTR0_LOGIC_RET_DEL_Pos   16UL
#define U55_MXU55_PPU_EDTR0_LOGIC_RET_DEL_Msk   0xFF0000UL
#define U55_MXU55_PPU_EDTR0_FULL_RET_DEL_Pos    24UL
#define U55_MXU55_PPU_EDTR0_FULL_RET_DEL_Msk    0xFF000000UL
/* U55_MXU55_PPU.EDTR1 */
#define U55_MXU55_PPU_EDTR1_MEM_OFF_DEL_Pos     0UL
#define U55_MXU55_PPU_EDTR1_MEM_OFF_DEL_Msk     0xFFUL
#define U55_MXU55_PPU_EDTR1_FUNC_RET_DEL_Pos    8UL
#define U55_MXU55_PPU_EDTR1_FUNC_RET_DEL_Msk    0xFF00UL
/* U55_MXU55_PPU.DCDR0 */
#define U55_MXU55_PPU_DCDR0_CLKEN_RST_DLY_Pos   0UL
#define U55_MXU55_PPU_DCDR0_CLKEN_RST_DLY_Msk   0xFFUL
#define U55_MXU55_PPU_DCDR0_ISO_CLKEN_DLY_Pos   8UL
#define U55_MXU55_PPU_DCDR0_ISO_CLKEN_DLY_Msk   0xFF00UL
#define U55_MXU55_PPU_DCDR0_RST_HWSTAT_DLY_Pos  16UL
#define U55_MXU55_PPU_DCDR0_RST_HWSTAT_DLY_Msk  0xFF0000UL
/* U55_MXU55_PPU.DCDR1 */
#define U55_MXU55_PPU_DCDR1_ISO_RST_DLY_Pos     0UL
#define U55_MXU55_PPU_DCDR1_ISO_RST_DLY_Msk     0xFFUL
#define U55_MXU55_PPU_DCDR1_CLKEN_ISO_DLY_Pos   8UL
#define U55_MXU55_PPU_DCDR1_CLKEN_ISO_DLY_Msk   0xFF00UL
/* U55_MXU55_PPU.IDR0 */
#define U55_MXU55_PPU_IDR0_DEVCHAN_Pos          0UL
#define U55_MXU55_PPU_IDR0_DEVCHAN_Msk          0xFUL
#define U55_MXU55_PPU_IDR0_NUM_OPMODE_Pos       4UL
#define U55_MXU55_PPU_IDR0_NUM_OPMODE_Msk       0xF0UL
#define U55_MXU55_PPU_IDR0_STA_OFF_SPT_Pos      8UL
#define U55_MXU55_PPU_IDR0_STA_OFF_SPT_Msk      0x100UL
#define U55_MXU55_PPU_IDR0_STA_OFF_EMU_SPT_Pos  9UL
#define U55_MXU55_PPU_IDR0_STA_OFF_EMU_SPT_Msk  0x200UL
#define U55_MXU55_PPU_IDR0_STA_MEM_RET_SPT_Pos  10UL
#define U55_MXU55_PPU_IDR0_STA_MEM_RET_SPT_Msk  0x400UL
#define U55_MXU55_PPU_IDR0_STA_MEM_RET_EMU_SPT_Pos 11UL
#define U55_MXU55_PPU_IDR0_STA_MEM_RET_EMU_SPT_Msk 0x800UL
#define U55_MXU55_PPU_IDR0_STA_LGC_RET_SPT_Pos  12UL
#define U55_MXU55_PPU_IDR0_STA_LGC_RET_SPT_Msk  0x1000UL
#define U55_MXU55_PPU_IDR0_STA_MEM_OFF_SPT_Pos  13UL
#define U55_MXU55_PPU_IDR0_STA_MEM_OFF_SPT_Msk  0x2000UL
#define U55_MXU55_PPU_IDR0_STA_FULL_RET_SPT_Pos 14UL
#define U55_MXU55_PPU_IDR0_STA_FULL_RET_SPT_Msk 0x4000UL
#define U55_MXU55_PPU_IDR0_STA_FUNC_RET_SPT_Pos 15UL
#define U55_MXU55_PPU_IDR0_STA_FUNC_RET_SPT_Msk 0x8000UL
#define U55_MXU55_PPU_IDR0_STA_ON_SPT_Pos       16UL
#define U55_MXU55_PPU_IDR0_STA_ON_SPT_Msk       0x10000UL
#define U55_MXU55_PPU_IDR0_STA_WRM_RST_SPT_Pos  17UL
#define U55_MXU55_PPU_IDR0_STA_WRM_RST_SPT_Msk  0x20000UL
#define U55_MXU55_PPU_IDR0_STA_DBG_RECOV_SPT_Pos 18UL
#define U55_MXU55_PPU_IDR0_STA_DBG_RECOV_SPT_Msk 0x40000UL
#define U55_MXU55_PPU_IDR0_DYN_OFF_SPT_Pos      20UL
#define U55_MXU55_PPU_IDR0_DYN_OFF_SPT_Msk      0x100000UL
#define U55_MXU55_PPU_IDR0_DYN_OFF_EMU_SPT_Pos  21UL
#define U55_MXU55_PPU_IDR0_DYN_OFF_EMU_SPT_Msk  0x200000UL
#define U55_MXU55_PPU_IDR0_DYN_MEM_RET_SPT_Pos  22UL
#define U55_MXU55_PPU_IDR0_DYN_MEM_RET_SPT_Msk  0x400000UL
#define U55_MXU55_PPU_IDR0_DYN_MEM_RET_EMU_SPT_Pos 23UL
#define U55_MXU55_PPU_IDR0_DYN_MEM_RET_EMU_SPT_Msk 0x800000UL
#define U55_MXU55_PPU_IDR0_DYN_LGC_RET_SPT_Pos  24UL
#define U55_MXU55_PPU_IDR0_DYN_LGC_RET_SPT_Msk  0x1000000UL
#define U55_MXU55_PPU_IDR0_DYN_MEM_OFF_SPT_Pos  25UL
#define U55_MXU55_PPU_IDR0_DYN_MEM_OFF_SPT_Msk  0x2000000UL
#define U55_MXU55_PPU_IDR0_DYN_FULL_RET_SPT_Pos 26UL
#define U55_MXU55_PPU_IDR0_DYN_FULL_RET_SPT_Msk 0x4000000UL
#define U55_MXU55_PPU_IDR0_DYN_FUNC_RET_SPT_Pos 27UL
#define U55_MXU55_PPU_IDR0_DYN_FUNC_RET_SPT_Msk 0x8000000UL
#define U55_MXU55_PPU_IDR0_DYN_ON_SPT_Pos       28UL
#define U55_MXU55_PPU_IDR0_DYN_ON_SPT_Msk       0x10000000UL
#define U55_MXU55_PPU_IDR0_DYN_WRM_RST_SPT_Pos  29UL
#define U55_MXU55_PPU_IDR0_DYN_WRM_RST_SPT_Msk  0x20000000UL
/* U55_MXU55_PPU.IDR1 */
#define U55_MXU55_PPU_IDR1_PWR_MODE_ENTRY_DEL_SPT_Pos 0UL
#define U55_MXU55_PPU_IDR1_PWR_MODE_ENTRY_DEL_SPT_Msk 0x1UL
#define U55_MXU55_PPU_IDR1_SW_DEV_DEL_SPT_Pos   1UL
#define U55_MXU55_PPU_IDR1_SW_DEV_DEL_SPT_Msk   0x2UL
#define U55_MXU55_PPU_IDR1_LOCK_SPT_Pos         2UL
#define U55_MXU55_PPU_IDR1_LOCK_SPT_Msk         0x4UL
#define U55_MXU55_PPU_IDR1_MEM_RET_RAM_REG_Pos  4UL
#define U55_MXU55_PPU_IDR1_MEM_RET_RAM_REG_Msk  0x10UL
#define U55_MXU55_PPU_IDR1_FULL_RET_RAM_REG_Pos 5UL
#define U55_MXU55_PPU_IDR1_FULL_RET_RAM_REG_Msk 0x20UL
#define U55_MXU55_PPU_IDR1_FUNC_RET_RAM_REG_Pos 6UL
#define U55_MXU55_PPU_IDR1_FUNC_RET_RAM_REG_Msk 0x40UL
#define U55_MXU55_PPU_IDR1_STA_POLICY_PWR_IRQ_SPT_Pos 8UL
#define U55_MXU55_PPU_IDR1_STA_POLICY_PWR_IRQ_SPT_Msk 0x100UL
#define U55_MXU55_PPU_IDR1_STA_POLICY_OP_IRQ_SPT_Pos 9UL
#define U55_MXU55_PPU_IDR1_STA_POLICY_OP_IRQ_SPT_Msk 0x200UL
#define U55_MXU55_PPU_IDR1_OP_ACTIVE_Pos        10UL
#define U55_MXU55_PPU_IDR1_OP_ACTIVE_Msk        0x400UL
#define U55_MXU55_PPU_IDR1_OFF_MEM_RET_TRANS_Pos 12UL
#define U55_MXU55_PPU_IDR1_OFF_MEM_RET_TRANS_Msk 0x1000UL
/* U55_MXU55_PPU.IIDR */
#define U55_MXU55_PPU_IIDR_IMPLEMENTER_Pos      0UL
#define U55_MXU55_PPU_IIDR_IMPLEMENTER_Msk      0xFFFUL
#define U55_MXU55_PPU_IIDR_REVISION_Pos         12UL
#define U55_MXU55_PPU_IIDR_REVISION_Msk         0xF000UL
#define U55_MXU55_PPU_IIDR_VARIANT_Pos          16UL
#define U55_MXU55_PPU_IIDR_VARIANT_Msk          0xF0000UL
#define U55_MXU55_PPU_IIDR_PRODUCT_ID_Pos       20UL
#define U55_MXU55_PPU_IIDR_PRODUCT_ID_Msk       0xFFF00000UL
/* U55_MXU55_PPU.AIDR */
#define U55_MXU55_PPU_AIDR_ARCH_REV_MINOR_Pos   0UL
#define U55_MXU55_PPU_AIDR_ARCH_REV_MINOR_Msk   0xFUL
#define U55_MXU55_PPU_AIDR_ARCH_REV_MAJOR_Pos   4UL
#define U55_MXU55_PPU_AIDR_ARCH_REV_MAJOR_Msk   0xF0UL
/* U55_MXU55_PPU.PID4 */
#define U55_MXU55_PPU_PID4_IMPLEMENTER_11_8_Pos 0UL
#define U55_MXU55_PPU_PID4_IMPLEMENTER_11_8_Msk 0xFUL
/* U55_MXU55_PPU.PID0 */
#define U55_MXU55_PPU_PID0_PRODUCT_ID_7_0_Pos   0UL
#define U55_MXU55_PPU_PID0_PRODUCT_ID_7_0_Msk   0xFFUL
/* U55_MXU55_PPU.PID1 */
#define U55_MXU55_PPU_PID1_PRODUCT_ID_11_8_Pos  0UL
#define U55_MXU55_PPU_PID1_PRODUCT_ID_11_8_Msk  0xFUL
#define U55_MXU55_PPU_PID1_IMPLEMENTER_3_0_Pos  4UL
#define U55_MXU55_PPU_PID1_IMPLEMENTER_3_0_Msk  0xF0UL
/* U55_MXU55_PPU.PID2 */
#define U55_MXU55_PPU_PID2_JEP106_ID_6_4_Pos    0UL
#define U55_MXU55_PPU_PID2_JEP106_ID_6_4_Msk    0x7UL
#define U55_MXU55_PPU_PID2_JDEC_Pos             3UL
#define U55_MXU55_PPU_PID2_JDEC_Msk             0x8UL
#define U55_MXU55_PPU_PID2_REV_Pos              4UL
#define U55_MXU55_PPU_PID2_REV_Msk              0xF0UL
/* U55_MXU55_PPU.PID3 */
#define U55_MXU55_PPU_PID3_PID3_REV_CONST_Pos   0UL
#define U55_MXU55_PPU_PID3_PID3_REV_CONST_Msk   0xFUL
#define U55_MXU55_PPU_PID3_PID3_REVISION_Pos    4UL
#define U55_MXU55_PPU_PID3_PID3_REVISION_Msk    0xF0UL
/* U55_MXU55_PPU.ID0 */
#define U55_MXU55_PPU_ID0_ID0_Pos               0UL
#define U55_MXU55_PPU_ID0_ID0_Msk               0xFFUL
/* U55_MXU55_PPU.ID1 */
#define U55_MXU55_PPU_ID1_ID1_Pos               0UL
#define U55_MXU55_PPU_ID1_ID1_Msk               0xFFUL
/* U55_MXU55_PPU.ID2 */
#define U55_MXU55_PPU_ID2_ID2_Pos               0UL
#define U55_MXU55_PPU_ID2_ID2_Msk               0xFFUL
/* U55_MXU55_PPU.ID3 */
#define U55_MXU55_PPU_ID3_ID3_Pos               0UL
#define U55_MXU55_PPU_ID3_ID3_Msk               0xFFUL


/* U55_PD.CTL */
#define U55_PD_CTL_BLEED_EN_Pos                 0UL
#define U55_PD_CTL_BLEED_EN_Msk                 0x1UL
/* U55_PD.PWR_UP_DELAY */
#define U55_PD_PWR_UP_DELAY_COUNT_LOAD_Pos      0UL
#define U55_PD_PWR_UP_DELAY_COUNT_LOAD_Msk      0xFFUL
#define U55_PD_PWR_UP_DELAY_MEM_COUNT_LOAD_Pos  8UL
#define U55_PD_PWR_UP_DELAY_MEM_COUNT_LOAD_Msk  0xFF00UL


#endif /* _CYIP_U55_H_ */


/* [] END OF FILE */
